innombrable/app/controllers/bodegueros_controller.rb

SELECT  `bodegueros`.* FROM `bodegueros` WHERE `bodegueros`.`usuario_id` = 2 LIMIT 1
SELECT `clientes_internos`.`id` FROM `clientes_internos` WHERE `clientes_internos`.`bodega_id` = 1
SELECT `solicitudes`.* FROM `solicitudes` WHERE `solicitudes`.`cliente_id` = 1
---
  def mod_solicitudes
    @bodeguero = Bodeguero.find_by(usuario_id: current_user.id)
    @clientes = ClientesInterno.where(bodega_id: @bodeguero.bodega_id)
    @solicitudes = Solicitude.where(cliente_id: @clientes.ids)

SELECT  `bodegueros`.* FROM `bodegueros` WHERE `bodegueros`.`usuario_id` = 2 LIMIT 1
SELECT `materiales`.* FROM `materiales` WHERE `materiales`.`bodega_id` = 1
---
  def mod_inventario
    @bodeguero = Bodeguero.find_by(usuario_id: current_user.id)
    #@bodega = Bodega.where(bodeguero_id: @bodeguero.id)
    @materiales = Materiale.where(bodega_id: @bodeguero.bodega_id)