innombrable/app/controllers/bodegueros_centrales_controller.rb

  def mod_inventarios
    @materiales = Materiale.all
---
SELECT `materiales`.* FROM `materiales`