innombrable/app/controllers/clientes_internos_controller.rb

SELECT  `solicitudes`.* FROM `solicitudes` WHERE `solicitudes`.`usuario_id` = 1 LIMIT 1
SELECT  `clientes_internos`.* FROM `clientes_internos` WHERE `clientes_internos`.`usuario_id` = 1 LIMIT 1
SELECT  `bodegueros`.* FROM `bodegueros` WHERE `bodegueros`.`bodega_id` = 1 LIMIT 1
SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 2 LIMIT 1
---
  def ver_solicitudes
    if current_user.tipo == "cliente interno"
        @solicitudes = Solicitude.where(usuario_id: current_user.id)
        @cliente = ClientesInterno.find_by(usuario_id: current_user.id)
        @bodeguero = Bodeguero.find_by(bodega_id: @cliente.bodega_id)
        @usuario_bo = Usuario.find(@bodeguero.usuario_id)

INSERT INTO `solicitudes` (`material`, `cantidad`, `prioridad`, `usuario_id`, `estado`, `created_at`, `updated_at`) VALUES ('hghghghg', 7, 7, 1, 0, '2018-06-08 23:25:07', '2018-06-08 23:25:07')
---
  def create
    @formu = params[:solicitude]
    @solicitude = Solicitude.new(usuario_id: current_user.id, material: @formu[:material], cantidad: @formu[:cantidad], prioridad: @formu[:prioridad], estado: "En revisión")

    if @solicitude.save