innombrable/app/controllers/clientes_internos_controller.rb

SELECT `solicitudes`.* FROM `solicitudes` WHERE `solicitudes`.`cliente_id` = 1
---
  def ver_solicitudes
    if current_user.tipo == "cliente interno"
        @cliente = ClientesInterno.find_by(usuario_id: current_user.id)
        @solicitudes = Solicitude.where(cliente_id: @cliente.id)