innombrable/app/controllers/ordenes_controller.rb

SELECT  `bodegueros`.* FROM `bodegueros` WHERE `bodegueros`.`usuario_id` = 2 LIMIT 1
SELECT `obras`.`id` FROM `obras` WHERE `obras`.`bodega_id` = 1
SELECT `clientes_internos`.`id` FROM `clientes_internos` WHERE `clientes_internos`.`obra_id` = 1
---
  def create
    @bodeguero = Bodeguero.find_by(usuario_id: current_user.id)
    @obra = Obra.where(bodega_id: @bodeguero.bodega_id)
    @cliente = ClientesInterno.where(obra_id: @obra.ids)