innombrable/app/controllers/sessions_controller.rb

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`rut` = 1234567 LIMIT 1
---
  def create
  	usuario = Usuario.find_by(rut: params[:session][:rut])