innombrable/app/controllers/usuarios_controller.rb

	def show
		@usuario = Usuario.find(params[:id])
---
SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1